 /*
  * ------------------------------------------------------------
  * 语法点：二维数组，变长数组
  * 来源：鹏哥C语言2026  第48-50集
  * 日期：2026-09-23
  * ------------------------------------------------------------
  *
  * 【它解决什么问题】
  *  一维数组作为数组的元素，就是二维数组
  *
  * 【语法格式】
  *  type arr_name[常量值1][常量值2];
  *  int arr[3][5]; 表示数组3行5列
  *
  * 【关键注意点】
  *   变长数组不可以初始化
  *   vs不能用变长数组
  *
  * 【和相似语法的区别】
  *  一维数组中元素都是内置类型
  *  初始化时可以省略行，但不可以省略列
  */
#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>

//int main(void)
//{
//    //不完全初始化
//    int arr[3][5] = {1,2,3};
//   //完全初始化
//    int arr2[3][5] = {1,2,3,4,5,2,3,4,5,6,3,4,5,6,7};
//    //按行初始化
//    int arr3[3][5] = { {1,2},{2,3},{3,4} };
//    //printf("%d", arr3[2][1]);
//    int i = 0;
//    for (i = 0; i < 3; i++)
//    {
//        int j = 0;
//        for (j = 0;j < 5;j++)
//        {
//            printf("%d", arr3[i][j]);
//        }
//        printf("\n");
//
//    }
//    return 0;
//}
int main()
{
	int arr1[5] = { 0 };
	int arr2[2 + 3] = { 0 };
	int n = 0;
	scanf("%d", &n);
	int arr3[n];//arr就是变成数组
	//vs不支持变长数组

	return 0;
}
