/*
 * ------------------------------------------------------------
 * 语法点：操作符详解
 * 来源：鹏哥C语言2026  第80-84集
 * 日期：2026-10-11
 * ------------------------------------------------------------
 * 【语法格式】
 *  8进制数字前面加0，16进制数字前面加0x
 *  &按位与操作符    |按位或操作符   ^按位异或操作符    ~按位取反操作符
 *  &&逻辑与操作符    ||逻辑或操作符    !逻辑非操作符
 *  <<左移操作符    >>右移操作符    移动的是二进制的位
 *   左移规则：左边抛弃，右边补0   逻辑右移：右边抛弃，左边补0  算术右移：右边抛弃，左边补原符号位
 * 【关键注意点】
 *  有符号整数分为符号位和数值位，第一个数字为数值为，0表示正，1表示负
 *  正整数的补码反码和原码相同，负整数的补码是原码取反加1，反码是按位取反的
 *  对于整数来说，数据存放内存中存放的是补码，计算机进行运算时也是用补码进行运算的
 *  不能移动负数位
 *
 */

#include <stdio.h>

 //int main()
 //{
 //    int a = -13;
 //	//10000000000000000000000000001101  -   -13的原码
 //	//11111111111111111111111111110010  -   -13的反码
 //	//11111111111111111111111111110011  -   -13的补码
 //	int b = 0;
 //	//00000000000000000000000000001101  -   13的原码
 //	//00000000000000000000000000001101  -   13的反码
 // //00000000000000000000000000001101  -   13的补码
 //	unsigned int c = 13;
 //	//00000000000000000000000000001101  -   13的原码
 //	//00000000000000000000000000001101  -   13的反码
 //	//00000000000000000000000000001101  -   13的补码
 //    return 0;
 //}

 //移位操作符

//int main()
//{
//	int a = -10;//
//	int b = a << 1;
//	int c = a >> 1;
//	printf("%d\n", c);
//	printf("%d\n", b);
//	printf("%d\n", a);
//	return 0;
//}

//&按位与对应二进制有0则为0，同时为1则为1
//|按位或对应二进制有1则为1，同时为0则为0
//^按位异或对应二进制相同为0，相异为1
int main()
{
	int a = 10;
	//00000000000000000000000000001010  -   10的补码
	int b = -7;
	//11111111111111111111111111111001  -   -7的补码
	int c = a & b;
	//00000000000000000000000000001000  -   c的补码	
	int d = a | b;
	//11111111111111111111111111111011  -   d的补码
	int e = a ^ b;
	//11111111111111111111111111110011  -    e的补码
	printf("%d\n", e);
	printf("%d\n", d);//-5
	printf("%d", c);//8
	int f = 0;
	//00000000000000000000000000000000     -    0的补码
	printf("%d", ~f);
	//11111111111111111111111111111111     -    -1的补码

	return 0;
}