 /*
  * ------------------------------------------------------------
  * 语法点：操作符详解3（结构成员访问操作符，优先级和结合性，整型提升和算术转换）
  * 来源：鹏哥C语言2026  第90-93集
  * 日期：2026-10-13
  * ------------------------------------------------------------
  *
  * 【它解决什么问题】
  *  描述的东西内置类型不够用
  *
  * 【语法格式】
  *  struct 自定义名字
  * {
  *       成员列表（一个或多个）
  * }
  * 示例
  * struct Student
  *{
  *   char name[20];//名字
  *   int age;//年龄
  *   float score;//成绩 
  *};       分号不能丢
  *
  * 【关键注意点】
  *  字符类型也属于整形家族
  *  整型提升：
  *   有符号整数提升是按照变量的数据类型的符号位来提升的，也就是在高位补充符号位
  *   无符号数提升，高位补0
  *  算术转换：如果某个操作符的各个操作数属于不同的类型，那么除非其中一个操作数转换为另一个操作数的类型，否则操作就无法进行
  *  尽量不要写太复杂的表达式（尤其是含有++，--的式子）
  */


#include <stdio.h>

//struct Student
//{
//    char name[20];//名字
//    int age;//年龄
//    float score;//成绩 
//}s6,s7,s8;//s6 s7s8都是全局变量  //分号不能丢
//
////全局变量
//struct Student s4;
//struct Student s5;
//
//int main()
//{
//    //局部变量
//    struct Student s1;
//    struct Student s2;
//    struct Student s3;
//    return 0;
//}
//struct Student
//{
//    char name[20];//名字
//    int age;//年龄
//    float score;//成绩 
//};
//struct Test
//{
//    int n;
//    char c;
//    struct Student s;
//    double d;
//};
//int main()
//{
//    //局部变量
//    struct Student s1 = {"liming",18,85.5f};
//    struct Student s2 = { .score = 65.5f, .age = 12,.name = "wangwu"};
//    struct Test t = { 101,'q',{"zhangsan" , 18 , 85.5f}, 3.14};
//    printf("%s %d %.1f\n",s1.name,s1.age ,s1.score );
//    printf("%d  %c %s %d %.1f %.2f\n",t.n ,t.c ,t.s.name ,t.s.age ,t.s.score ,t.d);
//    //结构体变量.成员名
//    //结构体成员访问操作符
//    s1.age = 28;
//    printf("%s %d %.1f\n", s1.name, s1.age, s1.score);
//
//    return 0;
//}
//char 类型的取值范围是：-128~127
//int main()
//{
//	char a = 10;
//	//00000000000000000000000000001010
//	//00001010  -    a  截断
//	char b = 120;
//	//00000000000000000000000001111000
//	//01111000   -   b   截断
//	char c = 0;
//	c = a + b;
//	//00001010  -    a
//	//00000000000000000000000000001010
//	//01111000  -    b
//	//00000000000000000000000001111000
//	//00000000000000000000000010000010
//	//10000010   -    c
//	//11111111111111111111111110000010  原
//	//10000000000000000000000001111101  反
//	//10000000000000000000000001111110  补
//	printf("%d", c);//-126
//	//%d 是以10进制的形式打印有符号的整数
//	//%u 是以10进制的形式打印无符号的整数
//	return 0;
//}

