 /*
  * ------------------------------------------------------------
  * 语法点：数组 一维数组
  * 来源：鹏哥C语言2026  第44集
  * 日期：2026-09-20
  * ------------------------------------------------------------
  *
  * 【它解决什么问题】
  *   数组是一组相同类型元素的集合
  *   一维数组可以存放数据
  * 【语法格式】
  *type arr_name[常量值];
  *常量值用来指定数组的大小
  * type是指定数组中存放的数据类型
  * 【关键注意点】
  *   数组元素个数不能为0
  *   数组中存放的多个数据类型相同
  *   数组进行了初始化，数组的大小可以忽略
  *   数组的元素在内存中是连续存放的，随着下标的增长地址是由低到高变化的
  * 【和相似语法的区别】
  *
  */
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//int main(void)
//{
//    int i = 0;
//    int math[20];//创建数组
//    char ch[10];
//    double weight[30];
//
//    int age = 18;//初始化
//    int arr[5] = {1,2,3,4,5};//完全初始化
//    int d[5] = {1,2};//不完全初始化-剩余的元素会默认给成0
//    int d2[] = { 1,2 };//和上面一样
//    //int 是数组元素的类型
//    //int [10]是数组的类型
//    
//    printf("%d", arr[0]);
//    for (i = 0; i < 5; i++)
//    {
//        arr[i] = -(i + 1);
//        printf("%d",arr[i]);
//    }
//    return 0;
//}

//int main()
//{
//	int arr[10] = {0};
//	int i = 0;
//	//输入1~10
//	for (i = 0;i < 10;i++)
//	{
//		scanf("%d", &arr[i]);//arr[i]是数组元素，不是数组
//	}
//	//输出
//	for (i = 0;i < 10;i++)
//	{
//		printf("%d", arr[i]);
//	}
//	return 0;
//}

//%p-是用来打印地址的
int main()
{
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	printf("%zu\n", sizeof(arr));
	int sz = sizeof(arr) / sizeof(arr[0]);//计算的是数组的元素个数
	int i = 0;
	for (i = 0;i < sz;i++)
	{
		printf("%d",arr[i]);
	}
	return 0;
}
