 /*
  * ------------------------------------------------------------
  * 语法点：VS实用调试技巧
  * 来源：鹏哥C语言2026  第67-69集
  * 日期：2026-10-07
  * ------------------------------------------------------------
  *
  * 【它解决什么问题】
  *  更好更方便的调试代码
  * 【语法格式】
  *  debug是调试版本 release是发布版本
  */
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main(void)
{
    int arr[10] = {0};
	int i = 0;
    for (i = 0;i < 10;i++)
    {
        arr[i] = i;
    }
    for (i = 0;i < 10;i++)
    {
        printf("%d ", arr[i]);
    }
    return 0;
}
