
 /*
  * ------------------------------------------------------------
  * 语法点：内存和地址,指针变量和解引用操作符,指针变量的大小，指针变量类型的意义
  * 来源：鹏哥C语言2026  第94-98集
  * 日期：2026-10-14
  * ------------------------------------------------------------
  *
  * 【它解决什么问题】
  *
  *
  * 【语法格式】
  *  (指向对象的类型)* 指针变量名
  *
  * 【关键注意点】
  *  内存单元的编号==地址==指针
  *  变量创建的本质是在内存中申请空间
  *  32位平台下是32个bit位，指针变量大小是4个字节，64位平台下地址是64个bit位，指针变量大小是8个字节
  *  指针变量的大小和类型是无关的，在相同平台下 大小都是相同的
  *  指针的类型决定了，对指针解引用的时候有多大的权限（一次能操作几个字节）(57-70是例子)
  *  指针的类型决定了指针向前或者向后走一步走多大（距离(）(73-83是例子)
  *  
  * 【和相似语法的区别】
  *
  */

#include <stdio.h>
//%p 是专门用来打印地址的
//int main()
//{
//    int a = 10;
//    printf("%p\n", &a);//&   取地址操作符，取出的是a的地址
//    int* p = &a;//p就是指针变量，指针变量就是用来存放地址的变量
//    //*表示p是一个指针变量,int说明p指向的对象是int类型的
//
//    return 0;
//}


//int main()
//{
//	char ch = 'w';
//	char* pc = &ch;
//
//	return 0;
//}


//int main()
//{
//	int a = 100;
//	int* p = &a;
//	printf("%d\n", *p);//解引用操作符，*p的意思是通过p里边存放的地址，找到p指向的对象，也就是a，所以*p就是a
//	*p = 10;
//	printf("%d\n",a);
//	return 0;
//}

//int main()
//{
//	int a = 0x11223344;
//	int* p = &a;
//	*p = 0;
//	return 0;
//}
//int main()
//{
//	int a = 0x11223344;
//	char* p = &a;
//	*p = 0;
//	return 0;
//}

//int main()
//{
//	int a = 0x11223344;
//	int* pa = &a;
//	char* pc = &a;
//	printf("pa = %p\n", pa);
//	printf("pa + 1 = %p\n",pa+1);
//	printf("pc = %p\n", pc);
//	printf("pc + 1 = %p\n", pc + 1);
//	return 0;
//}


int main()
{
	char ch = 'w';
	int a = 20;
	void* pv1 = &ch;
	void* pv2 = &a;
	*pv2;
	pv2++;//无法对viod*类型进行解引用
	return 0;
}